app/Models/ModelRole.php

SELECT *
FROM `tb_role`
WHERE `email` = 'raihanramdhani229@gmail.com'
---
    public function dapatkan_user_role($email = false)
    {
        if ($email === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['email' => $email]);

SELECT COUNT(DISTINCT id_role) as total_petugas
FROM `tb_role`
WHERE `role` = 'petugas'
---
    public function total_petugas()
    {
        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT id_role) as total_petugas')
            ->where('role', 'petugas')
            ->get();

SELECT COUNT(DISTINCT id_role) as total_admin
FROM `tb_role`
WHERE `role` = 'admin'
---
    public function total_admin()
    {
        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT id_role) as total_admin')
            ->where('role', 'admin')
            ->get();