app/Models/ModelMember.php

SELECT *
FROM `tb_member`
WHERE `email` = 'raihanramdhani229@gmail.com'
---
    public function dapatkan_member($email = false)
    {
        if ($email === false) {
            return $this->findAll();
        } else {
            return $this->where('email', $email)->get();

SELECT *
FROM `tb_member`
---
    public function semua_member()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->get()
            ->getResultArray();

SELECT COUNT(DISTINCT id_member) as total_member
FROM `tb_member`
---
    public function total_member()
    {
        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT id_member) as total_member')
            ->get();