app/Models/ModelBuku.php

    public function semua_buku()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->join('tb_kategori_buku', 'tb_kategori_buku.id_kategori_buku = ' .$this->table .'.id_kategori_buku', 'left')
            ->join('tb_sub_kategori', 'tb_sub_kategori.id_sub_kategori = ' .$this->table.'.id_sub_kategori', 'left')
            ->orderBy('id_buku', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_buku`
LEFT JOIN `tb_kategori_buku` ON `tb_kategori_buku`.`id_kategori_buku` = `tb_buku`.`id_kategori_buku`
LEFT JOIN `tb_sub_kategori` ON `tb_sub_kategori`.`id_sub_kategori` = `tb_buku`.`id_sub_kategori`
ORDER BY `id_buku` ASC

    public function cari_buku($cari_buku)
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->join('tb_kategori_buku', 'tb_kategori_buku.id_kategori_buku = ' . $this->table . '.id_kategori_buku', 'left')
            ->join('tb_sub_kategori', 'tb_sub_kategori.id_sub_kategori = ' . $this->table . '.id_sub_kategori', 'left')
            ->like('judul', $cari_buku)
            ->orLike('tb_kategori_buku.nama_kategori_buku', $cari_buku)
            ->orderBy('id_buku', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_buku`
LEFT JOIN `tb_kategori_buku` ON `tb_kategori_buku`.`id_kategori_buku` = `tb_buku`.`id_kategori_buku`
LEFT JOIN `tb_sub_kategori` ON `tb_sub_kategori`.`id_sub_kategori` = `tb_buku`.`id_sub_kategori`
WHERE `judul` LIKE '%Babi%' ESCAPE '!'
OR  `tb_kategori_buku`.`nama_kategori_buku` LIKE '%Babi%' ESCAPE '!'
ORDER BY `id_buku` ASC

    public function total_buku()
    {
        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT id_buku) as total_buku')
            ->get();
---
SELECT COUNT(DISTINCT id_buku) as total_buku
FROM `tb_buku`

    public function kode_buku() {
        $query = $this->db->table('tb_buku');
        $count = $query->countAllResults();

        if ($count == 0) {
            return 'KB-001'; // Jika tidak ada data, beri nomor otomatis pertama
        } else {
            // Ambil nomor otomatis terkecil yang belum digunakan
            $usedCodes = $query->select('id_buku')->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_buku`
SELECT `id_buku`
FROM `tb_buku`