app/Models/ModelKategoriBuku.php

    public function semua_kategori_buku()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_kategori_buku`

    public function kode_kategori() {
        $query = $this->db->table('tb_kategori_buku');
        $count = $query->countAllResults();

        if ($count == 0) {
            return 'KK-001'; // Jika tidak ada data, beri nomor otomatis pertama
        } else {
            // Ambil nomor otomatis terkecil yang belum digunakan
            $usedCodes = $query->select('id_kategori_buku')->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_kategori_buku`
SELECT `id_kategori_buku`
FROM `tb_kategori_buku`

    public function total_kategori()
    {
        $query = $this->db->table($this->table)
            ->select('COUNT(DISTINCT id_kategori_buku) as total_kategori')
            ->get();
---
SELECT COUNT(DISTINCT id_kategori_buku) as total_kategori
FROM `tb_kategori_buku`