app/Models/ModelPeminjaman.php

    public function buku_dipinjam_by_member($id_member)
    {
        $query = $this->db->table('tb_peminjaman');
        $result = $query->select('*')
            ->join('tb_member', 'tb_member.id_member = tb_peminjaman.id_member')
            ->join('tb_buku', 'tb_buku.id_buku = tb_peminjaman.id_buku')
            ->join('tb_kategori_buku', 'tb_kategori_buku.id_kategori_buku = tb_buku.id_kategori_buku')
            ->where('tb_peminjaman.id_member', $id_member)
            ->where('status_peminjaman', 'di-pinjam')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_peminjaman`
JOIN `tb_member` ON `tb_member`.`id_member` = `tb_peminjaman`.`id_member`
JOIN `tb_buku` ON `tb_buku`.`id_buku` = `tb_peminjaman`.`id_buku`
JOIN `tb_kategori_buku` ON `tb_kategori_buku`.`id_kategori_buku` = `tb_buku`.`id_kategori_buku`
WHERE `tb_peminjaman`.`id_member` = '1'
AND `status_peminjaman` = 'di-pinjam'